# Вывести последнюю букву в слове
word = 'Архангельск'
print(word[-1])

# Вывести количество букв "а" в слове
word = 'Архангельск'
all_a = word.lower().count('а')
print(all_a)

# Вывести количество гласных букв в слове
word = 'Архангельск'
print(all_a+word.count('е'))


# Вывести количество слов в предложении
sentence = 'Мы приехали в гости'
print(len(sentence.split(' ')))


# Вывести первую букву каждого слова на отдельной строке
sentence = 'Мы приехали в гости'
# ???


# Вывести усреднённую длину слова в предложении
sentence = 'Мы приехали в гости'
# ???
